import { getTranslations } from 'next-intl/server';

import { SectionCarousel } from '@components/shared';

import { ProductItemType } from '@types';

// const products: ProductItemType[] = [
//     {
//         description: `Ячмінно-перлова крупа – це натуральний продукт, виготовлений із цільного ячмінного зерна шляхом очищення та шліфування. Завдяки мінімальній обробці вона зберігає всі корисні речовини, зокрема вітаміни групи B, магній, фосфор і клітковину.
// Ця крупа є універсальною в приготуванні: з неї готують каші, супи, плов та інші страви. Ячмінно-перлова крупа добре насичує, сприяє нормальному травленню й підтримує енергію на весь день.
// Обирайте ячмінно-перлову крупу для збалансованого харчування та натурального смаку у ваших улюблених стравах!`,
//         image: barley,
//         title: 'Ячменно-перлова крупа',
//     },
//     {
//         description: `Невибагливість і висока поживна цінність – саме тому ячмінно-ячнева крупа цінується в кулінарії. Виробництво цієї крупи – це процес, що зберігає природну користь ячменю, зберігаючи клітковину, вітаміни та мікроелементи.
// Ячмінно-ячнева крупа – універсальний продукт, який підходить для приготування каш, супів і гарнірів. Вона легко адаптується до різних кулінарних традицій, зберігаючи користь у будь-якому способі приготування.
// Обирайте якісну ячмінно-ячневу крупу для щоденного раціону – це природний смак і користь у кожній ложці!`,
//         image: barley,
//         title: 'Продукція з ячменю',
//     },
//     {
//         description: `Невибагливість і висока поживна цінність – саме тому ячмінно-ячнева крупа цінується в кулінарії. Виробництво цієї крупи – це процес, що зберігає природну користь ячменю, зберігаючи клітковину, вітаміни та мікроелементи.
// Ячмінно-ячнева крупа – універсальний продукт, який підходить для приготування каш, супів і гарнірів. Вона легко адаптується до різних кулінарних традицій, зберігаючи користь у будь-якому способі приготування.
// Обирайте якісну ячмінно-ячневу крупу для щоденного раціону – це природний смак і користь у кожній ложці!`,
//         image: barley,
//         title: 'Продукція з ячменю',
//     },
//     {
//         description: `Це натуральний продукт із твердих сортів пшениці, який зберігає всі корисні властивості зерна. Вона багата на білки, клітковину, вітаміни групи B та мікроелементи, необхідні для енергії та здоров'я.
//     Завдяки своїй універсальності пшенична крупа ідеально підходить для каш, гарнірів, супів та запіканок. Вона добре засвоюється, забезпечуючи тривале відчуття ситості.
//     Обирайте пшеничну крупу для збалансованого харчування та смачних страв щодня!`,
//         image: barley,
//         title: 'Пшенична крупа',
//     },
//     {
//         description: `Горохова крупа – це високоякісний продукт, отриманий шляхом лущення та шліфування гороху. Має високу харчову цінність завдяки великому вмісту рослинного білка (до 23%), клітковини, вітамінів та мінералів.
//     Пропонуємо постачання горохової крупи у великих обсягах для харчової промисловості, виробництва кормів та експорту. Продукція відповідає стандартам якості, фасується у мішки або біг-беги для зручного транспортування.
//     Гарантуємо стабільні поставки та індивідуальні умови співпраці для оптових клієнтів.`,
//         image: barley,
//         title: 'Горохова крупа',
//     },
//     {
//         description: `Гречана крупа — це один з найбільш цінних продуктів у світі здорового харчування, який поєднує природну чистоту і багатство корисних речовин. Вона багата на білок, клітковину, вітаміни групи B, магній, залізо та інші мінерали.
//     Ми пропонуємо оптові поставки гречаної крупи високої якості, упакованої в мішки або біг-беги. Продукція відповідає всім міжнародним стандартам і готова до експорту в будь-яку країну.
//     `,
//         image: barley,
//         title: 'Гречана крупа',
//     },
// ];

export const ProductsList = async () => {
    const t = await getTranslations('products');
    const productsList = t.raw('list') as ProductItemType[];

    return (
        <section className="bg-secondary pb-8 pt-20 desktop:pb-16 desktop:pt-24">
            <div className="container">
                <SectionCarousel items={productsList} />
            </div>
        </section>
    );
};
