import { StaticImageData } from 'next/image';

import { MoreInfo } from '@components/products/more-info';
import { WeOffer } from '@components/products/we-offer';
import { SectionCarousel } from '@components/shared';

import barley from '@assets/images/product_barley.jpg';

import { ProductItemType } from '@types';

const products: ProductItemType[] = [
    {
        description: `Ячмінно-перлова крупа – це натуральний продукт, виготовлений із цільного ячмінного зерна шляхом очищення та шліфування. Завдяки мінімальній обробці вона зберігає всі корисні речовини, зокрема вітаміни групи B, магній, фосфор і клітковину.
Ця крупа є універсальною в приготуванні: з неї готують каші, супи, плов та інші страви. Ячмінно-перлова крупа добре насичує, сприяє нормальному травленню й підтримує енергію на весь день.
Обирайте ячмінно-перлову крупу для збалансованого харчування та натурального смаку у ваших улюблених стравах!`,
        image: barley as StaticImageData,
        title: 'Ячменно-перлова крупа',
    },
    {
        description: `Невибагливість і висока поживна цінність – саме тому ячмінно-ячнева крупа цінується в кулінарії. Виробництво цієї крупи – це процес, що зберігає природну користь ячменю, зберігаючи клітковину, вітаміни та мікроелементи.
Ячмінно-ячнева крупа – універсальний продукт, який підходить для приготування каш, супів і гарнірів. Вона легко адаптується до різних кулінарних традицій, зберігаючи користь у будь-якому способі приготування.
Обирайте якісну ячмінно-ячневу крупу для щоденного раціону – це природний смак і користь у кожній ложці!`,
        image: barley as StaticImageData,
        title: 'Продукція з ячменю',
    },
    {
        description: `Невибагливість і висока поживна цінність – саме тому ячмінно-ячнева крупа цінується в кулінарії. Виробництво цієї крупи – це процес, що зберігає природну користь ячменю, зберігаючи клітковину, вітаміни та мікроелементи.
Ячмінно-ячнева крупа – універсальний продукт, який підходить для приготування каш, супів і гарнірів. Вона легко адаптується до різних кулінарних традицій, зберігаючи користь у будь-якому способі приготування.
Обирайте якісну ячмінно-ячневу крупу для щоденного раціону – це природний смак і користь у кожній ложці!`,
        image: barley as StaticImageData,
        title: 'Продукція з ячменю',
    },
    {
        description: `Це натуральний продукт із твердих сортів пшениці, який зберігає всі корисні властивості зерна. Вона багата на білки, клітковину, вітаміни групи B та мікроелементи, необхідні для енергії та здоров'я.
    Завдяки своїй універсальності пшенична крупа ідеально підходить для каш, гарнірів, супів та запіканок. Вона добре засвоюється, забезпечуючи тривале відчуття ситості.
    Обирайте пшеничну крупу для збалансованого харчування та смачних страв щодня!`,
        image: barley as StaticImageData,
        title: 'Пшенична крупа',
    },
    {
        description: `Горохова крупа – це високоякісний продукт, отриманий шляхом лущення та шліфування гороху. Має високу харчову цінність завдяки великому вмісту рослинного білка (до 23%), клітковини, вітамінів та мінералів.
    Пропонуємо постачання горохової крупи у великих обсягах для харчової промисловості, виробництва кормів та експорту. Продукція відповідає стандартам якості, фасується у мішки або біг-беги для зручного транспортування.
    Гарантуємо стабільні поставки та індивідуальні умови співпраці для оптових клієнтів.`,
        image: barley as StaticImageData,
        title: 'Горохова крупа',
    },
    {
        description: `Гречана крупа — це один з найбільш цінних продуктів у світі здорового харчування, який поєднує природну чистоту і багатство корисних речовин. Вона багата на білок, клітковину, вітаміни групи B, магній, залізо та інші мінерали.
    Ми пропонуємо оптові поставки гречаної крупи високої якості, упакованої в мішки або біг-беги. Продукція відповідає всім міжнародним стандартам і готова до експорту в будь-яку країну.
    `,
        image: barley as StaticImageData,
        title: 'Гречана крупа',
    },
];

export default function Products() {
    return (
        <div>
            <section className="h-full bg-secondary py-24">
                <div className="mx-auto mobile:w-[400px] tablet:w-[800px] desktop:w-[1200px]">
                    <SectionCarousel items={products} />
                </div>
            </section>
            <section className="w-full py-24">
                <WeOffer />
            </section>
            <section className="w-full bg-[url('../././assets/images/products_more_info_bg.jpg')] py-24">
                <MoreInfo />
            </section>
        </div>
    );
}
